In [2]:
import pandas as pd

# Create a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

# Convert the dictionary into a DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

# Save file as csv file

In [5]:
df.to_csv("csc_save_file_using_pandas.csv")

In [6]:
# if you want to ignore the index than do the index=False

In [7]:
df.to_csv("csc_save_file_using_pandas_without_index_file.csv",index=False)
df_saved = pd.read_csv("csc_save_file_using_pandas_without_index_file.csv")
print(df_saved)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [8]:
import pandas as pd

# Create a sample dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

# Convert the dictionary to DataFrame
df = pd.DataFrame(data)

# Save DataFrame to CSV, ensuring the index is not included
# Try with an explicit path to see where it's saving, if unsure
df.to_csv("output.csv", index=False)

# Confirm the file saved correctly by reading it back
df_saved = pd.read_csv("output.csv")
print(df_saved)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

# Save file as Excel (xls)

In [11]:
import pandas as pd

# Create a sample dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

# Convert the dictionary to DataFrame
df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

# Save file into Excel file

In [15]:
# df.to_excel("filenamme.xls") is syntax 
df.to_excel('Excel_file.xlsx')

In [17]:
# Use pd.read_excel() for reading .xls files
df = pd.read_excel('Excel_file.xls')  # xlrd is used for older .xls formats

# Display the DataFrame
df

   Unnamed: 0     Name  Age         City
0           0    Alice   25     New York
1           1      Bob   30  Los Angeles
2           2  Charlie   35      Chicago
3           3    David   40      Houston

# Save file into JSON

In [18]:
df.to_json('json_file.json')

In [21]:
df = pd.read_json('json_file.json')  # xlrd is used for older .xls formats

# Display the DataFrame
df

   Unnamed: 0     Name  Age         City
0           0    Alice   25     New York
1           1      Bob   30  Los Angeles
2           2  Charlie   35      Chicago
3           3    David   40      Houston